class KanaUtils {
  KanaUtils._();

  static String? getGarakeNextKana(String character) {
    final Map<String, String> garakeKanaConversionMap = {
      // ア行
      'ア': 'イ',
      'イ': 'ウ',
      'ウ': 'エ',
      'エ': 'オ',
      'オ': 'ア',

      // カ行
      'カ': 'キ',
      'キ': 'ク',
      'ク': 'ケ',
      'ケ': 'コ',
      'コ': 'カ',

      // サ行
      'サ': 'シ',
      'シ': 'ス',
      'ス': 'セ',
      'セ': 'ソ',
      'ソ': 'サ',

      // タ行
      'タ': 'チ',
      'チ': 'ツ',
      'ツ': 'テ',
      'テ': 'ト',
      'ト': 'タ',

      // ナ行
      'ナ': 'ニ',
      'ニ': 'ヌ',
      'ヌ': 'ネ',
      'ネ': 'ノ',
      'ノ': 'ナ',

      // ハ行
      'ハ': 'ヒ',
      'ヒ': 'フ',
      'フ': 'ヘ',
      'ヘ': 'ホ',
      'ホ': 'ハ',

      // マ行
      'マ': 'ミ',
      'ミ': 'ム',
      'ム': 'メ',
      'メ': 'モ',
      'モ': 'マ',

      // ヤ行
      'ヤ': 'ユ',
      'ユ': 'ヨ',
      'ヨ': 'ヤ',

      // ラ行
      'ラ': 'リ',
      'リ': 'ル',
      'ル': 'レ',
      'レ': 'ロ',
      'ロ': 'ラ',

      // ワ行
      'ワ': 'ヲ',
      'ヲ': 'ン',
      'ン': 'ー',
      'ー': 'ワ',
    };

    return garakeKanaConversionMap[character];
  }

  /// 濁点・半濁点の変換
  static String? switchKanaDiacritic(String character) {
    const Map<String, String> kanaConversionMap = {
      // 濁点付与
      'カ': 'ガ',
      'キ': 'ギ',
      'ク': 'グ',
      'ケ': 'ゲ',
      'コ': 'ゴ',
      'サ': 'ザ',
      'シ': 'ジ',
      'ス': 'ズ',
      'セ': 'ゼ',
      'ソ': 'ゾ',
      'タ': 'ダ',
      'チ': 'ヂ',
      'ツ': 'ヅ',
      'テ': 'デ',
      'ト': 'ド',
      'ハ': 'バ',
      'ヒ': 'ビ',
      'フ': 'ブ',
      'ヘ': 'ベ',
      'ホ': 'ボ',
      // 濁点 -> 半濁点
      'バ': 'パ',
      'ビ': 'ピ',
      'ブ': 'プ',
      'ベ': 'ペ',
      'ボ': 'ポ',
      // 濁点・半濁点除去
      'ガ': 'カ',
      'ギ': 'キ',
      'グ': 'ク',
      'ゲ': 'ケ',
      'ゴ': 'コ',
      'ザ': 'サ',
      'ジ': 'シ',
      'ズ': 'ス',
      'ゼ': 'セ',
      'ゾ': 'ソ',
      'ダ': 'タ',
      'ヂ': 'チ',
      'ヅ': 'ツ',
      'デ': 'テ',
      'ド': 'ト',
      'パ': 'ハ',
      'ピ': 'ヒ',
      'プ': 'フ',
      'ペ': 'ヘ',
      'ポ': 'ホ',
    };

    return kanaConversionMap[character];
  }
}
